#include <stdio.h>

typedef struct employee {
	int number;
	char name[20];
	char tele[20];
	int age;
}EMPLOYEE;

int main(void)
{
	EMPLOYEE e[10] = {
		{1, "È«±æµ¿1", "010-0000-0001", 20},
		{2, "È«±æµ¿2", "010-0000-0002", 25},
		{3, "È«±æµ¿3", "010-0000-0003", 60},
		{4, "È«±æµ¿4", "010-0000-0004", 40},
		{5, "È«±æµ¿5", "010-0000-0005", 50},
		{6, "È«±æµ¿6", "010-0000-0006", 45},
		{7, "È«±æµ¿7", "010-0000-0007", 32},
		{8, "È«±æµ¿8", "010-0000-0008", 23},
		{9, "È«±æµ¿9", "010-0000-0009", 29},
		{10, "È«±æµ¿10", "010-0000-0010", 62}
	};
	for (int i = 0; i < 10; i++)
	{
		if ((e[i].age >= 20) && (e[i].age <= 30))
			printf("ÀÌ¸§=%s  ³ªÀÌ=%d\n", e[i].name, e[i].age);
	}
	return 0;
}